[
    {
        "title": "Mengikuti ucapan muadzin saat adzan",
        "text": "‘Abdullah bin ‘Amr radhiyallahu ‘anhuma menyebutkan bahwa ia mendengar Rasulullah Shallallahu ‘Alaihi wa Sallam bersabda: “Jika kalian mendengarkan muadzin, maka ucapkan seperti yang ia ucapkan, lalu bershalawatlah untukku, karena siapa yang bershalawat padaku 1 kali, Allah akan bershalawat padanya 10 kali…” (HR. Muslim)"
    },

    {
        "title": "Berdoa di antara adzan dan iqamah",
        "text": "Dari Anas radhiyallahu ‘anhu, Rasulullah Shallallahu ‘Alaihi wa Sallam bersabda: “Doa itu tidak ditolak antara adzan dan iqamah…” (HR. al-Tirmidzy)"
    },

    {
        "title": "Membaca doa berangkat ke mesjid",
        "text": "Bunyinya adalah: Allaahumma-j’al fi qalbi nuuran, wa fi lisanii nuuran, waj’al fi sam’i nuuran, waj’al fi basharii nuuran, waj’al min khalfii nuuran, wa min amaamii nuuran, wa min fauqii nuuran, wa min tahtii nuuran. Allaahumma a’thinii nuuran.\nArtinya: “Ya Allah jadikanlah cahaya dalam hatiku, cahaya pada lisanku, cahaya pada pendengaranku, cahaya pada pandanganku, dan jadikanlah cahaya di belakangku, cahaya dari depanku, cahaya dari atasku, dan cahaya dari bawahku.Ya Allah, karuniakanlah cahaya untukku.”(HR.Muslim)"
    },

    {
        "title": "Masuk mesjid dengan kaki kanan",
        "text": "Masuk mesjid engucapkan : Bismillaah wash-shalaatu ‘alaa Rasuulillaah (Dengan menyebut Nama Allah dan shalawat atas Rasulullah)\nLalu membaca doa masuk mesjid\nBunyinya: Allaahummagh-firlii dzunuubii waftah lii abwaaba rahmatika “Ya Allah, ampunilah untukku dosa dosaku, dan bukakanlah untukku pintu-pintu rahmatMu.” (HR. Muslim)"
    },

    {
        "title": "Shalat 2 rakaat Tahiyatul masjid",
        "text": "Rasulullah Shallallahu ‘Alaihi wa Sallam bersabda: “Apabila salah seorang dari kalian masuk mesjid, maka janganlah ia duduk hingga mengerjakan shalat 2 rakaat.” (HR. Bukhari dan Muslim)"
    },

    {
        "title": "Meluruskan dan merapatkan shaf",
        "text": "Ibnu Mas’ud radhiyallahu ‘anhumenuturkan: “Adalah Rasulullah Shallallahu ‘Alaihi wa Sallam memegang pundak-pundak kami dalam shalat sembari berkata: ‘Luruskanlah, dan jangan kalian berselisih hingga hati-hati kalian pun berselisih.’” (HR. Muslim)"
    },

    {
        "title": "Berdoa dalam sujud",
        "text": "Banyak doa yang biasa dipanjatkan Rasulullah Shallallahu ‘Alaihi wa Sallam dalam sujudnya, diantaranya: Ya Muqallibal quluub, tsabbit qalbii ‘alaa diinika “Wahai Dzat yang membolak-balikkan hati, teguhkanlah hatiku di atas agamaMu.” (Dihasankan oleh al Tirmidzi) "
    },

    {
        "title": "Memandang ke arah jari telunjuk saat tasyahud ",
        "text": "Abdullah bin ‘Umar radhiyallahu ‘anhu menuturkan tentang isyarat telunjuk Nabi Shallallahu ‘Alaihi wa Sallam dalam tasyahud: “…Dan beliau memberi isyarat dengan jari yang ada setelah ibu jari ke arah kiblat, lalu beliau melemparkan pandangannya ke arahnya.” (Sanadnya shahih)"
    },
    {
        "title": "Menjawab salam dengan isyarat jika sedang shalat",
        "text": "Ibnu ‘Umar radhiyallahu ‘anhu pernah bertanya kepada Bilal radhiyallahu tentang bagaimana Rasulullah Shallallahu ‘Alaihi wa Sallam menjawab salam jika beliau sedang shalat, maka ia menjawab: “Beliau menjawab dengan memberi isyarat dengan tangan beliau.” (Lih. Shahih al-Tirmidzy)"
    },

]
