[
    {
        "title": "Mengikuti ucapan muadzin saat adzan, lalu bershalawat kepada Nabi Shallallahu ‘Alaihi wa Sallam",
        "text": "‘Abdullah bin ‘Amr radhiyallahu ‘anhuma menyebutkan bahwa ia mendengar Rasulullah Shallallahu ‘Alaihi wa Sallam bersabda: “Jika kalian mendengarkan muadzin, maka ucapkan seperti yang ia ucapkan, lalu bershalawatlah untukku, karena siapa yang bershalawat padaku 1 kali, Allah akan bershalawat padanya 10 kali…” (HR. Muslim)"
    },

    {
        "title": "Berdoa di antara adzan dan iqamah ",
        "text": "Dari Anas radhiyallahu ‘anhu, Rasulullah Shallallahu ‘Alaihi wa Sallam bersabda: “Doa itu tidak ditolak antara adzan dan iqamah…” (HR. al-Tirmidzy)"
    },

    {
        "title": "Membaca doa berangkat ke mesjid",
        "text": "Bunyinya adalah: Allaahumma-j’al fi qalbi nuuran, wa fi lisanii nuuran, waj’al fi sam’i nuuran, waj’al fi basharii nuuran, waj’al min khalfii nuuran, wa min amaamii nuuran, wa min fauqii nuuran, wa min tahtii nuuran. Allaahumma a’thinii nuuran.\nArtinya: “Ya Allah jadikanlah cahaya dalam hatiku, cahaya pada lisanku, cahaya pada pendengaranku, cahaya pada pandanganku, dan jadikanlah cahaya di belakangku, cahaya dari depanku, cahaya dari atasku, dan cahaya dari bawahku.Ya Allah, karuniakanlah cahaya untukku.”(HR.Muslim)"
    },

    {
        "title": "Masuk mesjid dengan kaki kanan dan membaca doa masuk masjid",
        "text": "Masuk mesjid engucapkan : Bismillaah wash-shalaatu ‘alaa Rasuulillaah (Dengan menyebut Nama Allah dan shalawat atas Rasulullah)\nLalu membaca doa masuk mesjid\nBunyinya: Allaahummagh-firlii dzunuubii waftah lii abwaaba rahmatika “Ya Allah, ampunilah untukku dosa dosaku, dan bukakanlah untukku pintu-pintu rahmatMu.” (HR. Muslim)"
    },

    {
        "title": "Mengerjakan shalat 2 rakaat Tahiyatul masjid",
        "text": "Rasulullah Shallallahu ‘Alaihi wa Sallam bersabda: “Apabila salah seorang dari kalian masuk mesjid, maka janganlah ia duduk hingga mengerjakan shalat 2 rakaat.” (HR. Bukhari dan Muslim)"
    },

    {
        "title": "Meluruskan dan merapatkan shaf (barisan) dalam shalat",
        "text": "Ibnu Mas’ud radhiyallahu ‘anhumenuturkan: “Adalah Rasulullah Shallallahu ‘Alaihi wa Sallam memegang pundak-pundak kami dalam shalat sembari berkata: ‘Luruskanlah, dan jangan kalian berselisih hingga hati-hati kalian pun berselisih.’” (HR. Muslim)"
    },

    {
        "title": "Berdoa dalam sujud",
        "text": "Banyak doa yang biasa dipanjatkan Rasulullah Shallallahu ‘Alaihi wa Sallam dalam sujudnya, diantaranya: Ya Muqallibal quluub, tsabbit qalbii ‘alaa diinika “Wahai Dzat yang membolak-balikkan hati, teguhkanlah hatiku di atas agamaMu.” (Dihasankan oleh al Tirmidzi) "
    },

    {
        "title": "Menggenggam lutut kiri dengan tangan kiri saat tasyahud akhir",
        "text": "Dari ‘Abdullah bin al-Zubair radhiyallahu ‘anhu bahwa jika Rasulullah Shallallahu ‘Alaihi wa Sallam duduk tasyahud beliau meletakkan tangan kanannya di atas paha kanannya dan tangan kirinya menggenggam lututnya (HR. Mus lim)"
    },

    {
        "title": "24.Memandang ke arah jari telunjuk saat tasyahud ",
        "text": "Abdullah bin ‘Umar radhiyallahu ‘anhu menuturkan tentang isyarat telunjuk Nabi Shallallahu ‘Alaihi wa Sallam dalam tasyahud: “…Dan beliau memberi isyarat dengan jari yang ada setelah ibu jari ke arah kiblat, lalu beliau melemparkan pandangannya ke arahnya.” (Sanadnya shahih)"
    },

    {
        "title": "Mengerjakan shalat sunnat di rumah ",
        "text": "Rasulullah Shallallahu ‘Alaihi wa Sallam bersabda: “Maka shalatlah kalian, wahai manusia, di rumah kalian, karena sesungguhnya shalat seseorang yang paling utama adalah di rumahnya, kecuali shalat wajib.” (HR. Bukhari dan Muslim)"
    },

    {
        "title": "28.Mengawali shalat malam dengan shalat 2 rakaat yang ringan (pendek) ",
        "text": "Rasulullah Shallallahu ‘Alaihi wa Sallam bersabda: “Apabila seorang dari kalian bangun di waktu malam, maka hendaklah ia membuka shalatnya dengan 2 rakaat yang ringan.” (HR. Muslim)"
    },

    {
        "title": "Mengerjakan shalat sunnat 2 rakaat setelah pulang shalat ‘Ied",
        "text": "Dari Abu Sa’id al-Khudri radhiyallahu ‘anhu: “Adalah Rasulullah Shallallahu ‘Alaihi wa Sallam tidak mengerjakan shalat apapun sebelum shalat ‘Ied. Lalu jika beliau kembali ke rumahnya, beliau mengerjakan shalat 2 rakaat.” (Dihasankan oleh al-Albani)"
    },

    {
        "title": "Disunnahkan mengerjakan shalat 2 rakaat di mesjid ketika tiba dari perjalanan",
        "text": "Dari Ka’ab radhiyallahu ‘anhu: “Bahwa Rasulullah Shallallahu ‘Alaihi wa Sallam bila tiba dari sebuah perjalanan di waktu dhuha, beliau masuk kemesjid lalu shalat2rakaat sebelum beliau duduk.” (HR. Bukhari dan Muslim) Imam al-Nawawi menjelaskan bahwa shalat 2 rakaat tersebut bukan shalat Tahiyatul masjid, tapi memang shalat yang disunnahkan bagi yang baru tiba dari perjalanan."
    },

    {
        "title": "Mengerjakan shalat sunnat di atas kendaraan saat dalam perjalanan ",
        "text": "Dari Jabir radhiyallahu ‘anhu: bahwasanya Nabi Shallallahu ‘Alaihi wa Sallam mengerjakan shalat di atas kendaraannya ke mana pun ia menghadap, maka jika beliau ingin mengerjakan shalat fardhu, beliau pun turun lalu menghadap ke arah kiblat (HR. Bukhari)."
    },

    {
        "title": "Menjawab salam dengan isyarat jika sedang shalat",
        "text": "Ibnu ‘Umar radhiyallahu ‘anhu pernah bertanya kepada Bilal radhiyallahu tentang bagaimana Rasulullah Shallallahu ‘Alaihi wa Sallam menjawab salam jika beliau sedang shalat, maka ia menjawab: “Beliau menjawab dengan memberi isyarat dengan tangan beliau.” (Lih. Shahih al-Tirmidzy)"
    },

    {
        "title": "33.Sujud syukur ketika mendapatkan sesuatu yang menggembirakan atau terhindar dari musibah",
        "text": "Dari Abu Bakrah radhiyallahu ‘anhu: bahwa Nabi Shallallahu ‘Alaihi wa Sallam jika mendapatkan hal yang menggembirakan atau membahagiakannnya, beliau segera sujud sebagai wujud syukur kepada Allah Ta’ala (Lih. Shahih Ibnu Majah)"
    },

    {
        "title": "Shalat 2 rakaat ketika hendak bertaubat dari dosa",
        "text": "Dari Abu Bakr radhiyallahu ‘anhu, bahwa Nabi Shallallahu ‘Alaihi wa Sallam bersabda: “Tidak ada seorang pun yang melakukan satu dosa, lalu ia berwudhu dengan sebaik-baiknya, lalu ia shalat 2 rakaat–dan memohon ampun-, melainkan Allah akan mengampuninya.” (Lih. Shahih Ibnu Majah)"
    },

    {
        "title": "35.Mengerjakan shalat sunnat sebelum shalat maghrib bagi yang masuk mesjid pada waktu itu",
        "text": "Rasulullah Shallallahu ‘Alaihi wa Sallam bersabda: “Shalatlah sebelum maghrib-beliau mengulanginya 3 kali, lalu berkata:- bagi yang mau…” Ini menunjukkan bahwa ia adalah sunnah yang sesekali dikerjakan bagi yang ada dimesjid."
    },

    {
        "title": "Mengerjakan shalat sunnat 4 rakaat sebelum adzan Zhuhur",
        "text": "Dari ‘Abdullah al-Sa’id radhiyallahu ‘anhu: bahwa Rasulullah Shallallahu ‘Alaihi wa Sallam pernah mengerjakan shalat 4 rakaat setelah matahari tergelincir sebelum shalat Zhuhur, lalu beliau mengatakan bahwa itu adalah saat dibukanya pintu langit (Lih. Shahih al-Tirmidzy)"
    },

    {
        "title": "Mengerjakan shalat 2 rakaat di antara adzan dan iqamah",
        "text": "Dari ‘Abdullah bin al-Mughaffal radhiyallahu ‘anhu, Nabi Shallallahu ‘Alaihi wa Sallam bersabda: “Di antara setiap adzan dan iqamah itu terdapat shalat, bagi yang mau (mengerjakan).” (HR. Bukhari)"
    },

    {
        "title": "Mengerjakan shalat 2 rakaat setelah shalat witir",
        "text": "Sebagaimana diceritakan oleh ‘Aisyah dan Ummu Salamah radhiyallahu ‘anhuma, bahwa Rasulullah Shallallahu ‘Alaihi wa Sallam jika usai mengerjakan shalat witir, beliau kemudian mengerjakan shalat 2 rakaat sambil duduk (HR. al-Tirmidzy)"
    }
]
