[
    {
        "title": "Banyak berdoa di saat senang dan lapang",
        "text": "Diriwayatkan secara shahih dari Nabi Shallallahu ‘Alaihi wa Sallam, bahwa beliau bersabda: “Barang siapa yang senang untuk dikabulkan doanya oleh Allah di saat susah dan sempit, maka hendaklah ia banyak berdoa di saat lapang.” (Lih. Shahih al-Targhib) "
    },

    {
        "title": "Berobsesi yang tinggi saat berdoa",
        "text": "Dari Abu Salamah radhiyallahu ‘anhu, Rasulullah Shallallahu ‘Alaihi wa Sallam bersabda: “Hendaknya seorang dari kalian melihat apa yang ia obsesikan (dalam doanya), karena sesungguhnya ia tidak tahu obsesinya yang manakah yang akan dikabulkan.” (HR. al Tirmidzy)"
    },

    {
        "title": "Bersungguh-sungguh dalam meminta ",
        "text": "Dari Anas bin Malik radhiyallahu ‘anhu, Rasulullah Shallallahu ‘Alaihi wa Sallam bersabda: “Apabila seorang dari kalian berdoa, maka bersungguh-sungguhlah meminta dan jangan mengatakan: ‘Ya Allah, jika Engkau mau maka berilah aku…” (HR. Bukharida Muslim)"
    },

    {
        "title": "Tidak tergesa-gesa minta dikabulkan",
        "text": "Dari Abu Hurairah radhiyallahu ‘anhu, bahwa Rasulullah Shallallahu ‘Alaihi wa Sallam bersabda: “Akan dikabulkan (doa) seorang dari kalian selama ia tidak tergesa-gesa, lalu mengatakan: ‘Aku telah berdoa amun belum juga dikabulkan.’” (HR. Bukhari dan Muslim)"
    },

    {
        "title": "Mengangkat tangan sesuai sunnah saat berdoa",
        "text": "Terutama ketika berdoa untuk meminta kepada Allah. Yaitu dengan mengangkat kedua tangan yang disatukan setinggi kedua bahu atau mendekatinya. Dari Ibnu ‘Abbas radhiyallahu ‘anhu, bahwa Rasulullah Shallallahu ‘Alaihi wa Sallam bersabda: “(Doa) meminta itu adalah dengan engkau mengangkat kedua tanganmu selurus dengan kedua pundakmu atau mendekatinya…” (Dishahihkan oleh al-Albani)"
    },

    {
        "title": "Berdoa di waktu-waktu yang mudah untuk dikabulkan ",
        "text": "Seperti antara adzan dan iqamah, setelah berwudhu, setelah ashar di hari Jum’at, di antara Shafa dan Marwa, sebelum salam dalam shalat, di malam Lailatul qadar, di sepertiga akhir malam, saat sedang bepergian, dan lain-lain."
    },

    {
        "title": "Berdoa saat mendapatkan musibah",
        "text": "Dari Ummu Salamah radhiyallahu ‘anha, Rasulullah Shallallahu ‘Alaihi wa Sallam bersabda: “Tidak seorang muslim pun yang ditimpa musibah lalu ia mengucapkan apa yang diperintahkan Allah padanya, yaitu: ‘Innaa lillaahi wa innaa ilaihi raaji’uun, Allaahumma ajirnii fii mushibatii wakhlufnii khaira minhaa’ (Sesungguhnya kami milik Allah dan sesungguhnya kami akan kembali padaya. Ya Allah berikanlah pahala untukku dalam musibahku, dangantikanlah untukku yang lebih baik darinya), melainkan Allah akan menggantikan untuknya yang lebih baik darinya.” (HR. Muslim)"
    },

    {
        "title": "Mendoakan saudara muslim lainnya tanpa sepengetahuannya ",
        "text": "Dari Abu al-Darda’ radhiyallahu ‘anhu, bahwa Rasulullah Shallallahu ‘alaihi wa sallam bersabda: “Barang siapa yang mendoakan saudaranya tanpa sepengetahuannya, maka malaikat yang ditugaskan menjaganya akan mengatakan: ‘Amin, dan semoga untukmu juga hal yang sama’.”(HR. Muslim)"
    },

    {
        "title": "Berdoa ketika hujan turun ",
        "text": "Dari ‘Aisyah radhiyallahu ‘anha, bahwa Rasulullah Shallallahu ‘alaihi wa sallam jikaturun hujan beliau berdoa: “Allahumma-j’alhu shayyiban naafi’an” (Ya Allah, jadikanlah ia hujan yang bermanfaat). Diriwayatkan oleh al Nasa’i secara shahih."
    },

    {
        "title": "Berdoa saat mendengarkan kokok ayam dan beristi’adzah (mohon perlindungan) saat mendengar lolong anjing",
        "text": "Dari Abu Hurairah radhiyallahu ‘anhu, bahwa Rasulullah Shallallahu ‘alaihi wa sallam bersabda: “Apabila kalian mendengarkan kokok ayam, maka mohonlah kepada Allah akan karuniaNya, karena sesungguhnya (ayam itu) sedang melihat malaikat. Dan apabila kalian mendengarkan (dalam riwayat Abu Dawud: lolongan anjing dan ringkikan keledai), maka mohon perlindunganlah pada Allah dari syetan, karena sesungguhnya (anjing itu) melihat syetan.” (HR. Bukhari)"
    },

    {
        "title": "Berdoa saat melihat hal yang menakjubkan dari dunia",
        "text": "Rasulullah Shallallahu ‘alaihi wa sallam dalam kondisi ini berdoa: Allaahumma laa ‘aisya illaa ‘aisyal-akhirah, faghfir lil anshaar wal muhaajirah “Ya Allah, tidak kehidupan (hakiki) selain kehidupan akhirat, maka ampunilah kaum Anshar dan Muhajirin.” (HR. Bukhari) Tujuan doa ini agar seorang muslim tidak terlena oleh ketakjuban akan dunia."
    },

    {
        "title": "Penting: Berdoa saat singgah, turun atau berhenti di sebuah tempat ",
        "text": "Rasulullah Shallallahu ‘alaihi wa sallam bersabda: “Barangsiapa yang singgah di sebuah tempat, lalu berdoa: A’udzu bi kalimaatil Lahi-ttaammaati min syarri maa khalaq (aku berlindung dengan kalimat-kalimat Allah yang sempurna dari kejahatan apa yang Ia ciptakan), maka tidak akan memudharatkannya sesuatu pun hingga ia pergi meninggalkan tempat itu.” (HR. Muslim)"
    }
]
