[
    {
        "title": "Berkumur-kumur dan istinsyaq (me-masukkan air ke hidung) 3 kali dengan satu tangan",
        "text": "Diriwayatkan oleh Bukhari dan Muslim, bahwa Ibnu ‘Umar radhiyallahu ‘anhu ketika mencontohkan wudhu Nabi Shallallahu ‘Alaihi wa Sallam, ia berkumur-kumur dan beristinsyaq dengan meng-gunakan satu tangan sebanyak 3 kali."
   
    },

    {
        "title": "Melebihkan air saat beristinsyaq",
        "text": "Rasulullah Shallallahu ‘Alaihi wa Sallam bersabda: “Ratakanlah wudhu’, usaplah di sela selajari dan lebihkanlah dalam istinsyaq, kecuali jika engkau sedang berpuasa.” (HR. al-Tirmidzi) "
        
    },

    {
        "title": "Bersiwak/Membersihkan gigi dan mulut sebelum berwudhu",
        "text": "Rasulullah Shallallahu ‘Alaihi wa Sallam bersabda: “Seandainya aku tidak akan memberatkan umatku, niscaya akan aku perintahkan mereka untuk bersiwak setiap kali berwudhu.” (Dishahihkan oleh Ibnu al-Mulaqqin)."
       
    },

    {
        "title": "Menghemat penggunaan air saat berwudhu",
        "text": "Diriwayatkan oleh Anas radhiyallahu ‘anhu, bahwa jika Rasulullah Shallallahu ‘Alaihi wa Sallam mandi, beliau menggunakan air sebanyak 1 sha’. Dan bila beliau berwudhu, beliau menggunakan air sebanyak 1 mud. (Di-shahihkan oleh al-Albani)"
     
    },

    {
        "title": "Berwudhu sebelum mandi junub ",
        "text": "Dari ‘Aisyah radhiyallahu ‘anha, ia mengatakan: “Adalah Rasulullah Shallallahu ‘Alaihi wa Sallam bila beliau mandi junub, beliau mencuci kedua tangannya, kemudian berwudhu seperti wudhu untuk shalat, lalu beliau mandi…” (HR. Bukhari dan Muslim)"
      
    },

    {
        "title": "Berwudhu jika akan makan dan minum bagi orang yang junub. ",
        "text": "Dari ‘Aisyah radhiyallahu ‘anha, ia mengatakan: “Adalah Rasulullah Shallallahu ‘Alaihi wa Sallam jika sedang junublaluingin makan atau tidur, maka beliau berwudhu seperti wudhu untuk shalat.” (HR. Muslim)"
    
    },

    {
        "title": "Berwudhu jika ingin mengulangi hubungan suami istri",
        "text": "Dari Sa’id al-Khudry radhiyallahu ‘anhu, Rasulullah Shallallahu ‘Alaihi wa Sallam bersabda: “Jika seorang dari kalian menggauli istrinya lalu ia ingin mengulanginya, maka hendaklah ia berwudhu.”(HR. Muslim)"
        
    },

    {
        "title": "Membaca doa setelah wudhu yang disyariatkan",
        "text": "Yaitu: Subhaanaka-Llaahumma wa bihamdika, asyhadu allaa ilaaha illa Anta, astaghfiruka wa atuubu ilaika. “Mahasuci Engkau ya Allah dan Maha terpuji. Aku bersaksi bahwa tiada tuhan yang berhak disembah selain Engkau. Aku memohon ampun dan bertaubat kepada-Mu.” (Dishahihkan oleh Al-Albani)"
      
    },

    {
        "title": "Mengerjakan shalat sunnat 2 rakaat setelah berwudhu",
        "text": "Dari ‘Uqbah bin ‘Amir radhiyallahu ‘anhu, Rasulullah Shallallahu ‘Alaihi wa Sallam mengatakan: “Tidak ada seorang pun yang berwudhu, lalu ia memperbaiki wudhunya, lalu shalat 2 rakaat dengan hati dan wajah yang khusyu’ untuk kedua (rakaat itu), melainkan ia berhak masuk surga.” (HR. Muslim)"
        
    }

]