[
    {
        "title": "Mandi dan memakai wewangian",
        "text": "Dari Abu Sa’id radhiyallahu ‘anhu, Nabi Shallallahu ‘Alaihi wa Sallam bersabda: “Tidaklah seseorang mandi di hari Jum’at dan bersuci semampunya, lalu memakai wewangian, lalu datang (ke mesjid) dengan tidak memisahkan 2 orang yang duduk (di mesjid) kemudian ia mengerjakan shalat yang diwajibkan atasnya dan diam bila imam berbicara berkhutbah-melainkan akan diampunkan dosanya yang ada diantara Jum’at itu dengan Jum’at yang lain.” (HR. Bukhari)"
    },

    {
        "title": "Bersegera pergi menghadiri Shalat Jum’at",
        "text": "Dari Abu Hurairah radhiyallahu ‘anhu, bahwa Rasulullah Shallallahu ‘Alaihi wa Sallam bersabda: “Barang siapa yang mandi di hari Jum’at seperti mandinya untuk junub, lalu ia berangkat awal (ke mesjid) maka ia seperti orang yang mengorbankan seekorunta. Dan siapa yang berangkat di waktu yang kedua, maka ia seperti orang yang mengorbankan seekor sapi. Dan siapa yang berangkat di saat yang ketiga, maka ia seperti orang yang mengorbankan seekor domba bertanduk…” (HR. Muslim)"
    },

    {
        "title": "Tidur dan makan setelah Shalat Jum’at ",
        "text": "Diriwayatkan oleh sahabat Sahl bin Sa’ad radhiyallahu ‘anhu, ia berkata: “Dahulu kami (di masa Rasulullah) tidur qailulah (sejenak di waktu siang) dan makan siang setelah (shalat) Jum’at.” (HR. Bukhari) "
    },

    {
        "title": "Jika mengantuk saat khutbah berpindah tempatlah",
        "text": "Dari Ibnu ‘Umar radhiyallahu ‘anhuma, Nabi Shallallahu ‘Alaihi wa Sallam bersabda: “Jika seorang dari kalian mengantuk pada hari Jum’at, maka hendaklah ia berpindah dari tempat duduknya itu.” (Lih. Silsilah al-Shahihah karya al-ALbani)"
    },

    {
        "title": "Shalat sunnat setelah shalat Jum’at",
        "text": "Bisa dilakukan sebanyak 2rakaat di rumah atau 4 rakaat di mesjid. Rasulullah Shallallahu ‘Alaihi wa Sallam bersabda: “Jika seorang dari kalian shalat Jum’at, maka hendaklah ia shalat 4 rakaat sesudahnya.” (HR. Muslim) Dalam hadits lain dikisahkan bahwa beliau Shallallahu ‘Alaihi wa Sallam tidak shalat setelah Jum’at hingga pulang dan mengerjakan shalat 2 rakaat dirumah beliau (HR. Bukhari)"
    }
]
