[
    {
        "title": "Tidak mencela makanan ",
        "text": "Dari Abu Hurairah radhiyallahu ‘anhu, ia berkata: “Tidak pernah Nabi Shallallahu ‘Alaihi wa Sallam mencelamakanan sekalipun, jika beliau menyukainya, beliau memakannya. Namun jika beliau tidak menyukainya, beliau mem biarkannya.” (HR. Bukhari dan Muslim)"
    },

    {
        "title": "Menjilati jari-jari sebelum membasuh dan mencucinya",
        "text": "Dari Ibnu ‘Abbas radhiyallahu ‘anhu, bahwa Nabi Shallallahu ‘Alaihi wa Sallam bersabda: “Jika seorang dari kalian makan, maka janganlah membasuh/mengelap tangannya hingga ia menjilatinya atau dijilatkan.” (HR. Bukhari)"
    },


    {
        "title": "Mengambil makanan yang jatuh lalu membersihkan kotorannya, kemudian memakannya",
        "text": "Dari Jabir radhiyallahu ‘anhu, Nabi Shallallahu ‘Alaihi wa Sallam bersabda: “…Jika suapan seorang dari kalian jatuh, maka hendaklah ia mengambilnya lalu membersihkan kotoran yang ada padanya dan memakannya serta membiarkannya untuk syetan…” (HR. Mus lim)"
    },


    {
        "title": "Menjilati tempat bekas makan",
        "text": "Dari Jabir radhiyallahu ‘anhu, bahwa Nabi Shallallahu ‘Alaihi wa Sallam memerintahkan untuk menjilati jari-jari dan tempat makan, lalu bersabda: “Sesungguhnya kalian tidak tahu di mana letak keberkahannya…”(HR. Muslim)"
    },


    {
        "title": "Tidak memulai makan dari bagian tengahnya",
        "text": "Nabi Shallallahu ‘Alaihi wa Sallam bersabda: “Sesungguhnya berkah itu turun di bagian tengah makanan, maka makanlah dari pinggirnya dan janganlah kalian makan dari bagian tengahnya.” (HR. al-Tirmidzy)"
    },


    {
        "title": "Minum sambil duduk",
        "text": "Rasulullah Shallallahu ‘Alaihi wa Sallam bersabda: “Janganlah seorang dari kalian minum sambil berdiri, maka barang siapa yang lupa, maka hendaklah ia memuntahkannya.” (HR. Muslim)"
    },


    {
        "title": "Bernafas saat minum di luar tempat minum sebanyak 3 kali",
        "text": "Anas radhiyallahu ‘anhu menceritakan bahwa Rasulullah Shallallahu ‘Alaihi wa Sallam menarik nafas saat minum sebanyak 3 kali (HR. Bukhari dan Muslim)."
    },


    {
        "title": "Memakan kurma/tamar saat sahur",
        "text": "Dari Abu Hurairah radhiyallahu ‘anhu, bahwa Nabi Shallallahu ‘Alaihi wa Sallam: “Sebaik-baik makanan sahur seorang mukmin adalah tamar/kurma.” (Dishahihkan oleh al Albani)"
    },


    {
        "title": "Mendoakan orang yang menyajikan/menyiapkan makanan untuk kita",
        "text": "Doanya adalah: Allaahumma baarik lahum fiimaa razaqtahum waghfir lahum warhamhum “Ya Allah, berkahilah mereka dalam apa yang Engkau karuniakan pada mereka, dan ampunilah mereka serta rahmatilah mereka.” (HR. Muslim)"
    }

]
