[
    {
        "title": "Cara berdiri di depan pintu saat berkunjung",
        "text": "Dari ‘Abdullah bin Busr radhiyallahu ‘anhu: “Adalah Rasulullah Shallallahu ‘alaihi wa sallam jika mendatangi pintu rumah orang lain, beliautidak berdiri persis menghadap pintunya, namun beliau berdiri di sisi kanan atau sisi kirinya…” Tujuannya agar jika tiba-tiba pintu dibuka, beliau tidak langsung melihat ke bagian dalam rumah itu."
    },

    {
        "title": "Mengucapkan salam saat berdiri dan berpamitan meninggalkan majlis ",
        "text": "Dari Abu Hurairah radhiyallahu ‘anhu, dari Nabi Shallallahu ‘alaihi wa sallam beliau bersabda: “Apabila seorang dari kalian selesai dari sebuah majlis, maka hendaklah ia mengucapkan salam…” (HR. Bukhari) "
    },

    {
        "title": "Tidak mendahului melepaskan tangan saat bersalaman",
        "text": "Dari Anas radhiyallahu ‘anhu, ia berkata: “Adalah beliau Shallallahu ‘alaihi wasallamjikaberjabat tangan dengan seseorang, beliau tidak melepaskan tangannya hingga dia sendirilah yang melepaskan tangan Rasulullah Shallallahu ‘alaihi wa sallam.” (Dishahihkan oleh al-Albanidalam Silsilah al-Shahihah)"
    },

    {
        "title": "Berdoa saat bersin atau mendengarkan orang lain bersin",
        "text": "Dari Abu Hurairah radhiyallahu ‘anhu, dari Nabi Shallallahu ‘alaihi wa sallam beliau bersabda: “Jika seorang dari kalian bersin, maka ucapkanlah: Alhamdulillaah, dan hendaknya saudaranya (yang mendengarnya) mengucapkan: Yarhamkal-Lah (Semoga Al lah merahmatimu). Lalu hendaklah ia (yang bersin) mengucapkan: YahdiikumulLahu wa yushlih baalakum (Semoga Allah memberimu petunjuk dan memperbaiki urusanmu).” (HR. Bukhari)"
    },

    {
        "title": "Melebihkan pengembalian hutang",
        "text": "Dengan catatan bahwa ini dilakukan tanpa perjanjian atau kesepakatan sebelumnya, karena jika demikian maka itu termasuk riba yang diharamkan. Dari Abu Hurairah radhiyallahu ‘anhu, ia berkata: “Adalah seorang pria memiliki piutang seekor unta besar pada Rasulullah Shallallahu ‘alaihi wa sallam, lalu orang itu datang menagihnya, maka beliau berkata: ‘Bayarlah ia!’ Para sahabat pun mencari untuk yang seumur namun tak menemukan kecuali yang lebih besar. Maka beliau berkata: ‘Bayarlah ia (dengan itu)’.” (HR. Bukhari)"
    },

    {
        "title": "Mendoakan orang yang meminjamkan saat mengembalikannya",
        "text": "Bunyinya adalah: BarakaLlah fii ahlika wa maalika (Semoga Allah memberkahi keluarga dan harta Anda). Lihat Shahih Ibnu Hibban."
    },

    {
        "title": "Membatalkan sumpah jika melihat ada maslahat yang lebih baik dari itu",
        "text": "Dari Abu Hurairah radhiyallahu ‘anhu, bahwa Rasulullah Shallallahu ‘alaihi wa sallam bersabda: “Barang siapa yang bersumpah, lalu ia melihat ada hal lain yang lebih baik, maka hendaklah ia membayarkaffarat untuk sumpah, lalu melakukan apa yangpandang lebih baik.” (HR. Muslim)"
    },

    {
        "title": "Mengangkat ‘amir’ (pemimpin) jika bepergian bertiga atau lebih ",
        "text": "Dari Said al-Khudri radhiyallahu ‘anhu, Rasulullah Shallallahu ‘alaihi wa sallam berkata: “Apabila ada 3 orang dalam perjalanan, maka hendaklah mereka mengangkat seorang dari mereka sebagai pemimpin.” (Dishahihkan oleh al-Albani)"
    },

    {
        "title": "Membantu istri dalam pekerjaan rumah",
        "text": "Dari al-Aswad: “Aku pernah bertanya kepada ‘Aisyah radhiyallahu ‘anha tentang apa yang dilakukan Rasulullah Shallallahu ‘alaihi wa sallam dirumah, laluiamenjawab: ‘Beliau biasa melakukan (membantu) pekerjaanistrinya. Makabilatibawaktu shalat, beliau keluar untuk shalat.” (HR. Bukhari)"
    },

    {
        "title": "Menjaga sunnah-sunnah fitrah",
        "text": "Sunnah-sunnah fitrah itu ada 5: berkhitan, mencukur rambut kemaluan, mencabutbulu ketiak, memotong kuku dan mencukur kumis (Diriwayatkan oleh Bukhari dan Muslim) "
    }
]
