[    
    {
        "title": "Puasa Syawal (6 hari pada bulan Syawal)",
        "text": "Dari Abu Ayyub Al-Anshory bahwasanya Rasulullah shallallahu ‘alaihi wa sallam bersabda, “Barang siapa berpuasa Ramadhan, kemudian melanjutkan dengan berpuasa enam hari pada bulan Syawal, maka seperti ia berpuasa sepanjang tahun.” (HR. Muslim)\n\n“Puasa pada bulan Ramadhan  seperti berpuasa sepuluh bulan , dan puasa enam hari setelahnya seperti berpuasa selama dua bulan, maka yang demikian itu (jika dilakukan) seperti puasa setahun.” (Hadits shahih Riwayat Ahmad)",
        "yt": "https://www.youtube.com/watch?v=0mH1Q6CtZd8"
    },
    {
        "title": "Puasa pada hari Arafah ",
        "text": "Rasulullah shallallahu ‘alaihi wa sallam bersabda,“Puasa pada hari Arofah, aku berharap kepada Allah agar mengampuni dosa-dosa setahun yang telah lalu dan setahun yang akan datang.” (HR. Muslim)",
        "yt": "https://www.youtube.com/watch?v=8325ZuyStmc"
    },
    {
        "title": "Puasa pada hari Asyura’ (10 Muharrom) dan sehari sebelumnya",
        "text": "Dari Abu Qotadah bahwasanya Nabi shallallahu ‘alaihi wa sallam bersabda,“Puasa pada hari ‘Asyuro’, aku berharap kepada Allah agar mengampuni dosa-dosa setahun yang telah lalu.” (HR. Muslim)/n/nRasulullah shallallahu ‘alaihi wa sallam bersabda,“Sungguh jika aku masih hidup sampai tahun depan aku akan berpuasa pada hari yang kesembilan.” (HR. Muslim)",
        "yt": "https://www.youtube.com/watch?v=jn2UfYE2gis"
    },
    {
        "title": "Puasa pada bulan Sya’ban",
        "text": "Dari ‘Aisyah radhiyallahu ‘anha, dia berkata:“Saya tidak pernah melihat Rasulullah shallallahu ‘alaihi wa sallam berpuasa sebulan penuh kecuali pada bulan Ramadhan, dan tidaklah saya melihat  beliau memperbanyak puasa dalam suatu bulan seperti banyaknya beliau berpuasa pada bulan sya’ban.” (HR. Bukhari)",
        "yt": "https://www.youtube.com/watch?v=5oA_bgyyHYk"
    },
    {
        "title": "Puasa Pada Bulan Muharrom",
        "text": "Berdasarkan hadits dari Abu Hurairah radhiyallahu ‘anhu bahwasanya Rasulullah shallallahu ‘alaihi wa sallam bersabda:“Puasa yang paling utama setelah puasa Ramadhan adalah puasa pada bulan Allah yakni bulan Muharrom, dan shalat yang paling utama setelah shalat fardhu adalah shalat malam.” (HR. Muslim)",
        "yt": "https://www.youtube.com/watch?v=lzEqyzE5FV0"
    },
    {
        "title": "Puasa Senin dan Kamis",
        "text": "Rasulullah shallallahu ‘alaihi wa sallam bersabda:“Amal-amal ditampakkan pada hari senin dan kamis, maka aku suka jika ditampakkan amalku dan aku dalam keadaan berpuasa.” (Shahih, riwayat An-Nasa’i)\n\nRasulullah shallallahu ‘alaihi wa sallam pernah ditanya tentang puasa pada hari senin, beliau bersabda:“Ia adalah hari ketika aku dilahirkan dan hari ketika aku diutus (atau diturunkan (wahyu) kepadaku ).” (HR. Muslim)",
        "yt": "https://www.youtube.com/watch?v=Uszy1O5V0Ag"
    },
    {
        "title": "Puasa Ayyamul Bidh (3 hari setiap bulan)",
        "text": "Dari Abu Hurairah radhiyallahu ‘anhu dia berkata,“Kekasihku, Rasulullah shallallahu ‘alaihi wa sallam Mewasiatkan kepadaku tiga perkara: puasa tiga hari setiap bulan,   dua rakaat shalat dhuha, dan  shalat witir sebelum tidur.” (HR. Bukhari Muslim)\n\nLebih dianjurkan untuk berpuasa pada hari baidh yakni tanggal 13, 14 dan 15 bulan Islam (Qomariyah). Berdasarkan perkataan salah seorang sahabat radhiyallahu ‘anhu, ia berkata: “Rasulullah shallallahu ‘alaihi wa sallam memerintahkan kami untuk berpuasa pada tiga hari ‘baidh’: tanggal 13, 14 dan 15.” (Hadits Hasan, dikeluarkan oleh An-nasa’i dan yang lainnya)",
        "yt": "https://www.youtube.com/watch?v=WQnQ7-e9CIM"
    },
    {
        "title": "Puasa Daud (Berpuasa Sehari dan Berbuka Sehari) ",
        "text": "Rasulullah shallallahu ‘alaihi wa sallam bersabda:“Puasa yang paling disukai Allah adalah puasa Nabi Dawud, dan shalat yang paling disukai Allah adalah Shalat Nabi Dawud, adalah beliau biasa tidur separuh malam, dan bangun pada sepertiganya, dan tidur pada seperenamnya, adalah beliau berbuka sehari dan berpuasa sehari.” (Muttafaqun ‘alaihi)",
        "yt": "https://www.youtube.com/watch?v=0hLzzWAd4as"
    }
]
