[    
    {
        "title": "Sholat Rawatib",
        "text": "Sholat sunnah rawatib adalah sholat yang mengiringi sholat fardu, baik yang dilakukan sebelum sholat fardu disebut sholat sunnah qabliyah, maupun yang dilakukan sesudah sholat fardu disebut sholat sunnah ba’diyah. Sholat ini bisa juga disebut sholat tathawwu’ muqayyad (sholat sunnah yang terikat) artinya terikat dikerjakan pada waktu sebelum atau sesudah seseorang mengerjakan sholat fardu.\n\nDalil yang mendasari sholat Rawatib:\n \n-Rawatib Shubuh-\n "Rasulullah dalam mengerjakan sholat-sholat sunnah itu tidak serajin dalam mengerjakan sholat sunnah dua rakaat sebelum subuh. (HR Bukhari, Muslim, Ahmad dan Abu Daud)\n\n-Rawatib Dzuhur-\n"Bersama Rasulullah saya sholat dua rakaat sebelum zuhur, dua rakaat sesudah zuhur, dua rakaat sesudah magrib, dua rakaat sesudah isya, dan dua rakaat sebelum subuh." (HR Bukhari)\n\n-Rawatib Ashar-\n"Allah akan merahmati hamba yang sholat empat rakaat sebelum sholat asar." (HR Abu Daud, At-Tirmidzi, dan Ibnu Hibban)\n\n-Rawatib Isya-\n"Allah akan merahmati hamba yang sholat empat rakaat sebelum sholat asar." (HR Abu Daud, At-Tirmidzi, dan Ibnu Hibban)",
        "yt": "https://www.youtube.com/watch?v=9-isLknJrfQ"
    },
    {
        "title": "Sholat Witir",
        "text": "Sholat witir ialah sholat sunnah muakkad yang sangat dianjurkan untuk dikerjakan. Sholat ini dilakukan setelah sholat isya dengan rakaat ganjil. Jumlah rakaatnya mulai dari satu rakaat, tiga rakaat, dan seterusnya\n\nDiriwayatkan dari Ibnu ‘Umar yang menceritakan bahwa Rasulullah bersabda, “Jadikanlah akhir sholatmu di malam hari dengan melakukan sholat witir.” (HR Bukhari dan Muslim ).",
        "yt": "https://www.youtube.com/watch?v=qkwHxA4_db8"
    },
    {
        "title": "Sholat Dhuha",
        "text": "Sholat dhuha adalah sholat sunnah yang dilakukan pada waktu pagi hari atau pada waktu dhuha. Waktu dhuha dimulai ketika matahari naik setinggi tombak, kira-kira mulai jam tujuh pagi. Melanggengkan mengerjakan sholat ini akan banyak memberikan keutamaan bagi yang mengerjakannya\n\n“ Rasulullah mengerjakan sholat dhuha dengan enam rakaat pada dua waktu. (1) ketika matahari terbit kira-kira lima belas menit Nabi sholat dua rakaat (sholat ini disebut sholat isyraq); (2) ketika matahari bersinar penuh menghiasi kira-kira seperempat langit dan masih berada pada sisi timur, Nabi sholat empat rakaat. ” (HR At Tirmidzi, An-Nasa'i, dan Ibnu Majah).",
        "yt": "https://www.youtube.com/watch?v=X9oQaOZp4bE"
    },
    {
        "title": "Sholat Awwabin",
        "text": "Sholat awwabin adalah sholat sunnah yang bertujuan untuk memperbanyak ibadah agar bisa lebih mendekatkan diri pada Allah Yang Mahakuasa\n\nAbu Hurairah meriwayatkan bahwa Rasulullah pernah bersabda, “Siapa saja yang mengerjakan sholat sunnah sesudah sholat magrib sebanyak enam rakaat tanpa berkata-kata jelek di antara magrib dan isya, maka ia seperti telah beribadah sebanyak dua belas tahun.” (HR At-Tirmidzi)",
        "yt": "https://www.youtube.com/watch?v=WtuNSCmQaDE"
    },
    {
        "title": "Sholat Tahajud",
        "text": "Tahajud adalah sholat sunnah yang dilakukan setelah tidur, meskipun hanya sebentar. Karenanya, bila sholat ini dilakukan sebelum tidur, maka ia tidak lagi dapat dinamakan sholat tahajud, melainkan hanya sholat malam biasa, seperti halnya sholat sunnah yang lain.\n\n“Pada sebagian malam hari, maka kerjakanlah sholat tahajud sebagai suatu ibadah tambahan bagimu. Mudah-mudahan Tuhanmu mengangkatmu ke tempat yang terpuji,” (QS Al-Isra [17]:79)\n\nMengenai sholat ini, Rasulullah juga pernah bersabda, “Wahai sekalian manusia! Sebarkanlah salam, berikanlah makanan, sambunglah persaudaraan sanak kerabatmu, dan sholatlah di malam hari di saat kebanyakan orang sedang tidur nyeyak. Jika semua itu kalian lakukan, maka kalian akan masuk surga dengan selamat.68” (HR Hakim, Ibnu Majah, dan At-Tirmidzi)",
        "yt": "https://www.youtube.com/watch?v=i7rSKqSpTMU"
    },
    {
        "title": "Sholat Tarawih",
        "text": "Sholat tarawih adalah sholat sunnah yang dikerjakan pada malam hari setelah sholat isya selama bulan Ramadhan.\n\nDalam hadits disebutkan,"barangsiapa yang mengerjakan qiyam (sholat malam) pada bulan Ramadan dengan hati penuh iman dan mengharap ridla dari Allah SWT maka diampuni baginya dosa yang telah lewat"",
        "yt": "https://www.youtube.com/watch?v=LfrWvyINMWs"
    },
    {
        "title": "Sholat Idul Fitri",
        "text": "Sholat Idul Fitri adalah sholat sunnah yang dikerjakan pada hari pertama bulan Syawal, setelah berakhirnya bulan Ramadhan.\n\n"Kami diperintahkan keluar rumah untuk mengerjakan sholat laul Fitri. Anak-anak gadis (juga diperintahkan) keluar rumah untuk (bersama-sama) mengerjakan sholat laul Fitri. Termasuk perempuan perempuan yang yang sedang haid. Hanya saja Wanita yang sedang berhalangan ini berada di belakang orang-orang (yang mengerjakan sholat). Mereka juga ikut bertakbir dan berdoa bersama-sama berharap memperoleh keberkahan dan kesucian hari itu." (HR Bukhari, Ibn Majah, dan Baihaqi)"",
        "yt": "https://www.youtube.com/watch?v=0FW_c2saGHU"
    },
    {
        "title": "Sholat Idul Adha",
        "text": "Sholat Idul Adha yaitu sholat yang dikerjakan pada hari kesepuluh di bulan Dzulhijjah.\n\n“Kami diperntahkan keluar untuk sholat Hari Raya, bahkan anak-anak gadis juga diperintahkan keluar dari rumahnya untuk melakukan sholat Hari Raya dan juga perempuan-perempuan yang yang sedang haid (datang bulan), namun mereka hanya berada di belakang orang orang yang mengerjakan sholat serta mereka ikut bertakbir dan berdoa bersama-sama mengharapkan memperoleh keberkahan dan kesucian hari itu.” (HR -Bukhari).",
        "yt": "https://www.youtube.com/watch?v=B5X7CI6Fppo"
    },
    {
        "title": "Sholat Tahiyatul Mesjid",
        "text": "Sholat tahiyatul mesjid adalah sholat penghormatan pada mesjid, karena mesjid adalah tempat untuk beribadah pada Allah  baik siang maupun malam atau kapan saja, maka dari itu dianjurkan untuk memberi hormat dengan melakukan sholat tahiyatul mesjid.\n\n“Saya datang pada Nabi dan beliau berada di mesjid lalu beliau berkata sholatlah dua rakaat.” (HR Bukhari dan Muslim).",
        "yt": "https://www.youtube.com/watch?v=2JeGK1GrCNg"
    },
    {
        "title": "Sholat Dua Gerhana",
        "text": "Sholat dua gerhana yaitu sholat yang dilakukan karena terjadi gerhana matahari dan bulan.\n\n"Dan sebagian dari tanda-tanda kebesaran Allah -yaitu- adanya malam, siang, matahari dan bulan. Janganlah bersujud kepada matahari dan jangan -pula- bersujud pada bulan, tetapi bersujudlah kepada Allah yang menciptakan. Hanya kepada-Nya kalian menyembah." (QS Fushilat [41]:37)",
        "yt": "https://www.youtube.com/watch?v=AJAzlUGwQ8c"
    },
    {
        "title": "Sholat Istikharah",
        "text": "Sholat istikharah adalah sholat yang dilakukan untuk memohon kepada Allah  agar memberikan pilihan yang baik dari dua pilihan atau menghilangkan keraguan hati dalam memilih diantara dua pilihan supaya tidak menyesal di kemudian hari.\n\nRasulullah bersabda, “Tidak akan menyesal orang yang mengerjakan sholat istikharah dan tidak akan kecewa orang yang bermusyawarah serta tidak akan kekurangan orang yang berhemat.”",
        "yt": "https://www.youtube.com/watch?v=lwlfXSHu25U"
    }
]
