[
    {
        "title": "Sholat Shubuh",
        "text": "Para ulama sepakat bahwa awal waktu sholat shubuh dimulai sejak terbitnya fajar kedua. Fajar kedua adalah fajar shodiq yang merupakan cahaya putih yang memanjang di arah ufuk, cahaya ini akan terus menerus menjadi lebih terang hingga terbit matahari. Para ulama juga sepakat bahwa akhir waktu sholat shubuh dimulai sejak terbitnya matahari.\n\n“Tidaklah akan masuk neraka orang yang melaksanakan shalat sebelum terbitnya matahari (yaitu shalat shubuh) dan shalat sebelum tenggelamnya matahari (yaitu shalat ashar).” (HR. Muslim no. 634)",
        "yt": "https://www.youtube.com/watch?v=SgcImwx_0WY"
    },

    {
        "title": "Sholat Dzuhur",
        "text": "Secara bahasa Zhuhur berarti waktu Zawal yaitu waktu tergelincirnya matahari (waktu matahari bergeser dari tengah-tengah langit) menuju arah tenggelamnya (barat).\n\n“Waktu Zhuhur dimulai saat matahari tergelincir ke barat (waktu zawal) hingga bayangan seseorang sama dengan tingginya dan selama belum masuk waktu ‘Ashar” (HR. Muslim no. 612).",
        "yt": "https://www.youtube.com/watch?v=ioO08ZzhX58&t=43s"
    },

    {
        "title": "Sholat Ashar",
        "text": "Secara bahasa ‘Ashar  diartikan sebagai waktu sore hingga matahari memerah yaitu akhir dari dalam sehari.\n\n“Barangsiapa meninggalkan shalat Ashar, maka terhapuslah amalannya” (HR. Bukhari no. 594).",
        "yt": "https://www.youtube.com/watch?v=HahI3_TPjtY"
    },
    
    {
        "title": "Sholat Maghrib",
        "text": "Secara bahasa maghrib berarti waktu dan arah tempat tenggelamnya matahari. Sholat maghrib adalah sholat yang dilaksanakan pada waktu tenggelamnya matahari.\n\nhadits Nabi shollallahu ‘alaihi was sallam dari Sahabat ‘Uqbah bin ‘Amir rodhiyallahu ‘anhu,  “Umatku akan senantiasa dalam kebaikan (atau fithroh) selama mereka tidak mengakhirkan waktu sholat maghrib hingga munculnya bintang (di langit)”",
        "yt": "https://www.youtube.com/watch?v=HdGqId6MuZw"
    },
    
    {
        "title": "Sholat Isya",
        "text": "Secara bahasa ‘Isya’ adalah sebuah nama untuk saat awal langit mulai gelap (setelah maghrib) hingga sepertiga malam yang awal. Sholat ‘isya’ disebut demikian karena dikerjakan pada waktu tersebut.\n\nRasulullah SAW pernah bersabda, “Barang siapa shalat Isya berjamaah, maka ia bagaikan shalat (sunah) setengah malam, dan barang siapa shalat Subuh secara berjamaah, maka ia bagaikan shalat (sunah) semalam penuh.” (HR Muslim, Abu Daud, dan Tirmidzi).",
        "yt": "https://www.youtube.com/watch?v=INdzVzP73sI"
    }
]
