[
    {
        "title": "Mengibas-ngibaskan tempat tidur saat akan tidur",
        "text": "Dari Abu Hurairah radhiyallahu ‘anhu, bahwa Nabi Shallallahu ‘Alaihi wa Sallam bersabda: “Jika seorang dari kalian akan berangkat ke pembaringannya, maka hendaknya ia mengibas-ngibaskan tempat tidurnya dengan ujung kain sarungnya, karena ia tidak tahu apa yang ditinggalkan (tempat tiduritu) untuknya…” (HR. Bukhari)"
    },

    {
        "title": "Membaca 3 surah terakhir dalam al-Qur’an (al-Ikhlas, al Falaq dan al-Nas)",
        "text": "Dari ‘Aisyah radhiyallahu ‘anhu, bahwa Rasulullah Shallallahu ‘Alaihi wa Sallam jika hendak tidur meniup kedua tangannya dan membaca 3 surah tersebut, lalumengusap seluruh tubuhnya (HR. Bukhari) Catatan: sebagian orang melakukannya setelah shalat. Ini sebenarnya menyelisihi sunnah."
    },

    {
        "title": "Meletakkan tangan kanan di bawah pipi kanan saat tidur",
        "text": "Dari Hudzaifah ibn al-Yaman radhiyallahu ‘anhu, bahwa Rasulullah Shallallahu ‘Alaihi wa Sallam jika akan tidur di malam hari, beliau meletakkan tangan (kanan)nya di atas pipi (kanan)nya, lalu membaca doa: Allahumma bismika amuutu wa ahya “Ya Allah, dengan NamaMu aku mati dan aku hidup”. (HR. Bukhari)"
    },

    {
        "title": "Bersiwak atau membersihkan mulu",
        "text": "Dari Hudzaifah radhiyallahu ‘anhu, bahwa Nabi Shallallahu ‘Alaihi wa Sallam jika bangun untuk shalat Tahajud di waktu malam, beliau menggosok mulutnya dengan siwak(HR. Bukhari)"
    },

    {
        "title": "Berdzikir jika terbangun dari tidur ",
        "text": "Rasulullah Shallallahu ‘Alaihi wa Sallam bersabda: “Barang siapa yang terbangun di waktu malam, maka hendaklah ia membaca: Laa ilaaha illaLlaah wahdahu laa syariika lahu, lahul mulku walahul hamdu, wahuwa ‘alaa kulli syai’in qadiir. Alhamdulillaah, subhaanallaah, laa ilaaha illaLlaah, waLlaahu akbar wa laa haula walaa quwwata illaa billaah (Tidak ada tuhan yang berhak disembah selain Allah satu-satuNya tiada sekutu bagiNya, bagiNya semua kekuasaan dan bagiNya segala pujian, dan Dia Mahakuasa atas segala sesuatu. Segala puji bagi Allah, Mahasuci Allah, tiada tuhan yang berhak disembah selain Allah, dan Allah Mahabesar, dan tidak ada daya dan kekuatan selain dengan Allah), Lalu mengatakan: Allaahummaghfirlii (Ya Allah, ampunilah aku), atau berdoa, melainkan akan dikabulkan untuknya…” (HR. Bukhari)"
    },

    {
        "title": "Menghirup air ke hidung lalu membuangnya (istintsar) saat bangun dari tidur",
        "text": "Dari Abu Hurairah radhiyallahu ‘anhu, bahwa Nabi Shallallahu ‘Alaihi wa Sallam bersabda: “Apabila seorang dari kalian bangun dari tidurnya, maka hendaklah beristintsar sebanyak 3 kali, karena sesungguhnya setan bermalam di lubang hidungnya.” (HR. Muslim)"
    }
]
